{
  "steps": [
    {
      "topic": {
        "type": "person",
        "label": "David Guetta"
      },
      "text": "Jane likes David Guetta. Pierre David Guetta, known professionally as David Guetta, is a French house music producer and DJ."
    },
    {
      "topic": {
        "type": "location",
        "label": "Paris"
      },
      "text": "The birth place of David Guetta is Paris, France. Paris is the capital and largest city of France."
    },
    {
      "topic": {
        "type": "building",
        "label": "Eiffel Tower"
      },
      "text": "The Eiffel Tower is located in Paris. The Eiffel Tower is a puddle iron lattice tower located on the Champ de Mars in Paris."
    },
    {
      "topic": {
        "type": "person",
        "label": "Émile Nouguier"
      },
      "text": "The Eiffel Tower is a significant building of Émile Nouguier. Émile Nouguier was a French civil engineer and architect."
    },
    {
      "topic": {
        "type": "date",
        "label": "February 20, 1898"
      },
      "text": "February 20th, 1898, is the death date of Émile Nouguier, and also the birth date of Jimmy Yancey."
    },
    {
      "topic": {
        "type": "person",
        "label": "Jimmy Yancey"
      },
      "text": "James Edwards, AKA Jimmy Yancey, was an African American boogie-woogie pianist, composer, and lyricist."
    },
    {
      "topic": {
        "type": "location",
        "label": "Chicago"
      },
      "text": "The birthplace of Jimmy Yancey is Chicago. Chicago is the largest city in the US state of Illinois and the third most populous city in the United States after New York City and Los Angeles."
    },
    {
      "topic": {
        "type": "building",
        "label": "Chicago Theatre"
      },
      "text": "Chicago is the location of the Chicago Theatre. The Chicago Theatre, originally known as the Balaban and Katz Chicago Theatre, is a landmark theater located on North State Street in the Loop area of Chicago, Illinois, in the United States."
    }
  ]
}
